var i = 0;
while (i === 0) {
  let p = prompt("Как тебя зовут?");
  if (
    p == "Алена" ||
    p == "Алёна" ||
    p == "Alena" ||
    p == "Аленус" ||
    p == "Alenus" ||
    p == "Алёнус" ||
    p == "алена" ||
    p == "алёна" ||
    p == "alena" ||
    p == "аленус" ||
    p == "alenus" ||
    p == "алёнус"
  ) {
    alert("Ах, " + p + ", это ты...");
    i = 1;
  } else if (p == null) {
    alert("Ты че нах");
  } else {
    alert("тебя сюда не звали -_-" + "\n" + "ну ладно, можешь посмотреть");
    i = 1;
  }
}
